/**
 ****************************************************************************************************
 * @file        time.h
 * @brief       通用定时器中断初始化代码(包括时钟配置/中断管理/GPIO设置等)
 ****************************************************************************************************
 * @attention
 * @note:     在使用此头文件时，需确保相关的依赖项已正确配置，
 * @contact:  微信公众号 - [GenBotter]，分享技术内容
 *            QQ群号 - [366182133]，在线技术支持
 *            淘宝店铺 - [https://genbotter.taobao.com]，提供配套硬件产品
 ****************************************************************************************************
 */
#ifndef __TIMER_H
#define __TIMER_H
#include "sys.h"

extern unsigned char flag_5ms;

void TIM3_Int_Init(uint16_t arr,uint16_t psc);

#endif

